Revit 2027 API
IFCParameterTemplate.SetPropertySetExportingFlag Method
 Define whether the provided property set must be included in export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPropertySetExportingFlag(
	PropertySetupType propertySetupType,
	string propertySetName,
	bool exportFlag
)
Public Sub SetPropertySetExportingFlag (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	exportFlag As Boolean
)
public:
void SetPropertySetExportingFlag(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	bool exportFlag
)
member SetPropertySetExportingFlag :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        exportFlag : bool -> unit
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
exportFlag Boolean
 The export flag.
Exceptions
Exception | Condition
ArgumentException |  A property set with the given name is not present in the template.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace